cask_args appdir: '/Applications'

# VCS
brew 'svn'
brew 'git'
brew 'git-lfs'
cask 'github'
brew 'gh'
brew 'gpg'

# zsh
brew 'zsh'
brew 'uutils-coreutils' # coreutils replacement
brew 'antidote'
brew 'fzf'
brew 'fd'
brew 'direnv'
brew 'starship'
brew 'zellij'
brew 'btop'
brew 'eza'
brew 'zoxide'
brew 'zinit'
brew 'stow'


# python
brew 'uv'
brew 'ruff'

# rust
brew 'rust'

# bash
brew 'shfmt'

# common libraries
brew 'libyaml'
brew 'libffi'
brew 'capnp'
brew 'ffmpeg'

# casks


# GUI apps
cask 'arc'

cask '1password'
cask '1password-cli'

cask 'dropbox-dash'
cask 'notion'

cask 'google-cloud-sdk'

cask 'logi-options+'
cask 'spotify'

# mac usability things
cask 'linearmouse'
cask 'raycast'
cask 'hiddenbar'
cask 'betterdisplay'
cask 'rectangle-pro'

# terminals
cask 'alacritty'
cask 'ghostty'
cask 'warp'
cask 'iterm2'

# editors
brew 'neovim'
cask 'cursor'
cask 'fleet'


# fonts
cask 'font-inconsolata'

cask 'font-source-code-pro'
cask 'font-sauce-code-pro-nerd-font'


cask 'font-fira-code-nerd-font'
cask 'font-fira-mono-for-powerline'

cask 'font-hack-nerd-font'
cask 'font-inconsolata'

cask 'font-jetbrains-mono-nerd-font'
cask 'font-jetbrains-mono'





# bk@3

# awscli
# biome
# c-ares
# ca-certificates
# cairo
# certifi
# cffi
# cmake
# coreutils
# cryptography
# curl
# direnv
# eza
# fd
# fontconfig
# freetype
# fribidi
# fzf
# gcc
# gd
# gdk-pixbuf
# gettext
# ghq
# giflib
# git
# git-lfs
# gitleaks
# glib
# gmp
# gnupg
# gnutls
# go-task
# graphite2
# graphviz
# grpcurl
# gts
# harfbuzz
# highway
# hub
# icu4c@76
# icu4c@77
# imath
# isl
# jasper
# jpeg-turbo
# jpeg-xl
# jq
# k9s
# krb5
# kubecolor
# kubetail
# lastpass-cli

# libzip
# little-cms2
# lpeg
# lsd
# lua
# luajit
# luv
# lz4
# lzo
# m4
# mpdecimal
# mpfr
# ncspot
# ncurses
# neovim
# netpbm
# nettle
# ninja
# npth
# oniguruma
# openexr
# openjdk
# openssl@3
# ossp-uuid
# p11-kit
# pango

# lsusb
# nvm
# parallel
# protobuf
# nmap

# pcre
# pcre2
# pinentry
# pinentry-mac
# pipx
# pixman
# poetry
# portaudio


# pv
# pycparser
# python-packaging
# python@3.12
# python@3.13
# readline
# ripgrep
# rtmpdump
# shfmt
# sqlite
# subversion
# sysbench
# tcl-tk
# tldr
# tmux
# tpm
# tree
# tree-sitter
# unbound
# unibilium
# utf8proc
# watch
# watchexec
# webp
# wget
# xorgproto
# xz
# zlib

# zstd


