alefragnani.bookmarks
alefragnani.project-manager

bbenoist.nix
brettm12345.nixfmt-vscode

christian-kohler.path-intellisense

davidanson.vscode-markdownlint

codezombiech.gitignore
eamodio.gitlens
editorconfig.editorconfig

llvm-vs-code-extensions.vscode-mlir

ms-python.debugpy
ms-python.python
ms-python.vscode-pylance
charliermarsh.ruff

ms-toolsai.jupyter
ms-toolsai.jupyter-renderers
ms-toolsai.vscode-jupyter-cell-tags
ms-toolsai.vscode-jupyter-slideshow

ms-vscode-remote.remote-ssh
ms-vscode-remote.remote-ssh-edit
ms-vscode-remote.vscode-remote-extensionpack
ms-vscode.remote-explorer
ms-vscode.remote-server

rust-lang.rust-analyzer

redhat.vscode-yaml
tamasfe.even-better-toml
bungcip.better-toml


timonwong.shellcheck
wholroyd.jinja

pkief.material-icon-theme
vscode-icons-team.vscode-icons
zhuangtongfa.material-theme
foxundermoon.shell-format